_protected/views/asset/_search.php


    <?php /* echo $form->field($model, 'amortization')->textInput(['maxlength' => true, 'placeholder' => 'Amortization']) */ ?>

    <?php echo $form->field($model, 'person_id')->widget(\kartik\widgets\Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\app\models\Person::find()->orderBy('id')->asArray()->all(), 'id', function ($model) {
            return $model['firstname'] . ' ' . $model['lastname'];
        }),
        'options' => ['placeholder' => 'Choose Person'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ])->label('Person'); ?>

    <?php echo $form->field($model, 'location_id')->widget(\kartik\widgets\Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\app\models\Location::find()->orderBy('id')->asArray()->all(), 'id', function ($model) {
            $room = \app\models\Room::findOne($model['room_id']);
            return $room->name . ' at ' . $room->building->name . '(' . $model['description'] . ')';
        }),
        'options' => ['placeholder' => 'Choose Location'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ])->label('Location'); ?>
---
SELECT * FROM `person` ORDER BY `id`
SELECT * FROM `building` WHERE `id`=1
SELECT * FROM `location` ORDER BY `id`
SELECT * FROM `room` WHERE `id`='1'