_protected/views/asset/index.php

SELECT * FROM `person`
---
        <?= $this->render('_search', ['model' => $searchModel]); ?>
    </div>
    <?php
    $persons = \app\models\Person::find()->asArray()->all();

SELECT * FROM `person`
---
                return $model->person->firstname . ' ' . $model->person->lastname;
            },
            'filterType' => GridView::FILTER_SELECT2,
            'filter' => \yii\helpers\ArrayHelper::map(\app\models\Person::find()->asArray()->all(), 'id', function ($model) {
                return $model['firstname'] . ' ' . $model['lastname'];
            }),

SELECT * FROM `building` WHERE `id`=1
SELECT * FROM `room` WHERE `id`=1
SELECT * FROM `location`
SELECT * FROM `room` WHERE `id`='1'
---
            ],
            'filterInputOptions' => ['placeholder' => 'Person', 'id' => 'grid-asset-search-person_id']
        ],
        [
            'attribute' => 'location_id',
            'label' => 'Location',
            'value' => function ($model) {
                $room = \app\models\Room::findOne($model->location->room_id);
                return $room->name . ' at ' . $room->building->name;
            },
            'filterType' => GridView::FILTER_SELECT2,
            'filter' => \yii\helpers\ArrayHelper::map(\app\models\Location::find()->asArray()->all(), 'id', function ($model) {
                $room = \app\models\Room::findOne($model['room_id']);
                return $room->name . ' at ' . $room->building->name;
            }),
            'filterWidgetOptions' => [
                'pluginOptions' => ['allowClear' => true],
            ],
            'filterInputOptions' => ['placeholder' => 'Location', 'id' => 'grid-asset-search-location_id']
        ],