_protected/views/location/index.php

                    return $model->room->name;
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => \yii\helpers\ArrayHelper::map(\app\models\Room::find()->asArray()->all(), 'id', 'name'),
---
SELECT * FROM `room`