_protected/views/transfer/_search.php

        ],
    ]); ?>

    <?= $form->field($model, 'asset')->widget(\kartik\widgets\Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\app\models\Asset::find()->orderBy('id')->asArray()->all(), 'id', 'name'),
        'options' => ['placeholder' => 'Choose Asset'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>

    <?= $form->field($model, 'person_from')->widget(\kartik\widgets\Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\app\models\Person::find()->orderBy('id')->asArray()->all(), 'id', function ($model){return $model['firstname'].' '.$model['lastname'];}),
        'options' => ['placeholder' => 'Choose Person'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>

    <?= $form->field($model, 'person_to')->widget(\kartik\widgets\Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\app\models\Person::find()->orderBy('id')->asArray()->all(), 'id', function ($model){return $model['firstname'].' '.$model['lastname'];}),
        'options' => ['placeholder' => 'Choose Person'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>

    <?php  echo $form->field($model, 'location_from')->widget(\kartik\widgets\Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\app\models\Location::find()->orderBy('id')->asArray()->all(), 'id', function ($model) {
            $room = \app\models\Room::findOne($model['room_id']);
            return $room->name . ' at ' . $room->building->name;
        }),
        'options' => ['placeholder' => 'Choose Location'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ])->label('Location From');  ?>

    <?php  echo $form->field($model, 'location_to')->widget(\kartik\widgets\Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\app\models\Location::find()->orderBy('id')->asArray()->all(), 'id', function ($model) {
            $room = \app\models\Room::findOne($model['room_id']);
            return $room->name . ' at ' . $room->building->name;
        }),
        'options' => ['placeholder' => 'Choose Location'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ])->label('Location To');  ?>
---
SELECT * FROM `asset` ORDER BY `id`
SELECT * FROM `person` ORDER BY `id`
SELECT * FROM `building` WHERE `id`=1
SELECT * FROM `location` ORDER BY `id`
SELECT * FROM `room` WHERE `id`='1'