_protected/views/transfer/index.php

                    return $model->asset0->name;
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => \yii\helpers\ArrayHelper::map(\app\models\Asset::find()->asArray()->all(), 'id', 'name'),
---
SELECT * FROM `asset`

                    {return NULL;}
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => \yii\helpers\ArrayHelper::map(\app\models\Person::find()->asArray()->all(), 'id', function ($model){return $model['firstname'].' '.$model['lastname'];}),
---
SELECT * FROM `person`

                    {return NULL;}
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => \yii\helpers\ArrayHelper::map(\app\models\Person::find()->asArray()->all(), 'id', function ($model){return $model['firstname'].' '.$model['lastname'];}),
---
SELECT * FROM `person`

                ],
                'filterInputOptions' => ['placeholder' => 'Person', 'id' => 'grid-transfer-search-person_to']
            ],
        [
                'attribute' => 'location_from',
                'label' => 'Location From',
                'value' => function ($model) {
                    $room = \app\models\Room::findOne($model->locationFrom->room_id);
                    return $room->name . ' at ' . $room->building->name.'/'.$model->locationFrom->description;
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => \yii\helpers\ArrayHelper::map(\app\models\Location::find()->asArray()->all(), 'id', function ($model) {
                    $room = \app\models\Room::findOne($model['room_id']);
                    return $room->name . ' at ' . $room->building->name;
                }),
                'filterWidgetOptions' => [
                    'pluginOptions' => ['allowClear' => true],
                ],
                'filterInputOptions' => ['placeholder' => 'Location', 'id' => 'grid-transfer-search-location_from']
            ],
        [
                'attribute' => 'location_to',
                'label' => 'Location To',
                'value' => function ($model) {
                    $room = \app\models\Room::findOne($model->locationTo->room_id);
                    return $room->name . ' at ' . $room->building->name.'/'.$model->locationTo->description;
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => \yii\helpers\ArrayHelper::map(\app\models\Location::find()->asArray()->all(), 'id', function ($model) {
                    $room = \app\models\Room::findOne($model['room_id']);
                    return $room->name . ' at ' . $room->building->name;
                }),
                'filterWidgetOptions' => [
                    'pluginOptions' => ['allowClear' => true],
                ],
                'filterInputOptions' => ['placeholder' => 'Location', 'id' => 'grid-transfer-search-location_to']
            ],
---
SELECT * FROM `building` WHERE `id`=1
SELECT * FROM `room` WHERE `id`=1
SELECT * FROM `location`
SELECT * FROM `room` WHERE `id`='1'