_protected/controllers/api/AssetController.php

    public function actionApplyTransfers()
    {
        $due_transfers = Transfer::find()->where(['date' => date('Y-m-d')])->all();
        foreach ($due_transfers as $transfer) {
            if ($asset = Asset::findOne($transfer['asset'])) {
                $asset->setAttributes(
                    [
                        'person_id' => $transfer['person_to'],
                        'location_id' => $transfer['person_to'],
                    ]
                );
                $asset->save();
---
SELECT * FROM `transfer` WHERE `date`='2020-09-11'
SELECT * FROM `asset` WHERE `id`=16
UPDATE `asset` SET `person_id`=3, `location_id`=3 WHERE `id`=16