_protected/controllers/AssetController.php

SELECT * FROM `asset` WHERE `id`='15'
---
    protected function findModel($id)
    {
        if (($model = Asset::findOne($id)) !== null) {