_protected/controllers/BuildingController.php

SELECT * FROM `room` WHERE `building_id`=2
---
    public function actionView($id)
    {
        $model = $this->findModel($id);
        $providerRoom = new \yii\data\ArrayDataProvider([
            'allModels' => $model->rooms,
        ]);
        return $this->render('view', [
            'model' => $this->findModel($id),
            'providerRoom' => $providerRoom,
        ]);

SELECT * FROM `building` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Building::findOne($id)) !== null) {