_protected/controllers/PersonController.php

    public function actionView($id)
    {
        $model = $this->findModel($id);
        $providerAsset = new \yii\data\ArrayDataProvider([
            'allModels' => $model->assets,
        ]);
        $providerTransfer = new \yii\data\ArrayDataProvider([
            'allModels' => $model->transfers,
        ]);
        return $this->render('view', [
            'model' => $this->findModel($id),
            'providerAsset' => $providerAsset,
            'providerTransfer' => $providerTransfer,
        ]);
---
SELECT * FROM `asset` WHERE `person_id`=3

    protected function findModel($id)
    {
        if (($model = Person::findOne($id)) !== null) {
---
SELECT * FROM `person` WHERE `id`='3'