_protected/controllers/TransferController.php

    protected function findModel($id)
    {
        if (($model = Transfer::findOne($id)) !== null) {
---
SELECT * FROM `transfer` WHERE `id`='34'