_protected/views/person/_formAsset.php

SELECT * FROM `building` WHERE `id`=1
SELECT * FROM `location` ORDER BY `id`
SELECT * FROM `room` WHERE `id`='1'
---
            'label' => 'Location',
            'type' => TabularForm::INPUT_WIDGET,
            'widgetClass' => \kartik\widgets\Select2::className(),
            'options' => [
                'data' => \yii\helpers\ArrayHelper::map(\app\models\Location::find()->orderBy('id')->asArray()->all(), 'id', function ($model) {
                    $room = \app\models\Room::findOne($model['room_id']);
                    return $room->name . ' at ' . $room->building->name;
                }),
                'options' => ['placeholder' => 'Choose Location'],
            ],