_protected/views/person/_formTransfer.php

            'label' => 'Asset',
            'type' => TabularForm::INPUT_WIDGET,
            'widgetClass' => \kartik\widgets\Select2::className(),
            'options' => [
                'data' => \yii\helpers\ArrayHelper::map(\app\models\Asset::find()->orderBy('name')->asArray()->all(), 'id', 'name'),
                'options' => ['placeholder' => 'Choose Asset'],
            ],
---
SELECT * FROM `asset` ORDER BY `name`

            'label' => 'Location From',
            'type' => TabularForm::INPUT_WIDGET,
            'widgetClass' => \kartik\widgets\Select2::className(),
            'options' => [
                'data' => \yii\helpers\ArrayHelper::map(\app\models\Location::find()->orderBy('id')->asArray()->all(), 'id', function ($model) {
                    $room = \app\models\Room::findOne($model['room_id']);
                    return $room->name . ' at ' . $room->building->name . '/' . $model['description'];
                }),
                'options' => ['placeholder' => 'Choose Location'],
            ],
---
SELECT * FROM `building` WHERE `id`=1
SELECT * FROM `location` ORDER BY `id`
SELECT * FROM `room` WHERE `id`='1'

            'label' => 'Location To',
            'type' => TabularForm::INPUT_WIDGET,
            'widgetClass' => \kartik\widgets\Select2::className(),
            'options' => [
                'data' => \yii\helpers\ArrayHelper::map(\app\models\Location::find()->orderBy('id')->asArray()->all(), 'id', function ($model) {
                    $room = \app\models\Room::findOne($model['room_id']);
                    return $room->name . ' at ' . $room->building->name . '/' . $model['description'];
                }),
                'options' => ['placeholder' => 'Choose Location'],
            ],
---
SELECT * FROM `building` WHERE `id`=1
SELECT * FROM `location` ORDER BY `id`
SELECT * FROM `room` WHERE `id`='1'